**Общее описание системы**
Система представляет собой аналог карточной RPG игры, в которой игроки строят деревни на поле размером 20x20 клеток. Каждый игрок в начале игры выбирает одну из характеристик, которая влияет на его действия в процессе игры: характеристика может уменьшать ущерб от стихийных бедствий, снижать стоимость строительства или ускорять рост деревьев.

В ходе игры игроки могут строить различные объекты (здания, деревья) на поле, используя карты, извлекаемые из соответствующих колод. Игроки также вытягивают карты случайных событий, которые могут иметь как положительное, так и отрицательное влияние на их территорию. Эти события могут включать стихийные бедствия, экономические кризисы или политические изменения.

Игроки зарабатывают очки за каждое успешно выполненное действие, например, за построенное здание или посаженное дерево. Потери очков могут происходить из-за негативных событий, таких как стихийные бедствия.

Победитель игры определяется на основе общего количества очков, полученных за успехи в строительстве и реакции на случайные события.
